{
    "Jobs": [
        {
            "id": "056ce8a5-7520-448a-a0a6-fa954bb6e1f2",
            "type": "Full Time",
            "url": "https://jobs.github.com/positions/056ce8a5-7520-448a-a0a6-fa954bb6e1f2",
            "created_at": "Thu July 29 20:38:32 UTC 2019",
            "posted": "8 Days ago",
            "company": "BentoBox",
            "company_url": "https://getbento.com/",
            "location": "New York, NY",
            "title": "Senior Software Engineer",
            "searchType": "JobsNearYou",
            "description": "\u003cp\u003eBentoBox puts restaurants online. We are transforming the hospitality industry by helping restaurants stay at the forefront of technology. Our simple and integrated platform gives restaurants industry-specific tools to manage their website and digital operations, delivered in a SaaS model. BentoBox powers industry leaders such as The Meatball Shop, Joseph Leonard, Union Square Hospitality Group, Major Food Group, Rose’s Luxury, Eleven Madison Park \u0026amp; many more. Learn more at \u003ca href=\"http://www.getbento.com\"\u003ewww.getbento.com\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eWe’re looking for a senior software engineer to help build the world’s best digital operations platform for restaurants. Our current technology stack consists mostly of Django / Python and React, but we are always looking to use the tools that are most appropriate for the task at hand.\u003c/p\u003e\n\u003cp\u003eResponsibilities\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWork with designers, product managers, and other engineers to implement new features on our platform\u003c/li\u003e\n\u003cli\u003eContribute clean, clear, high quality production code\u003c/li\u003e\n\u003cli\u003eHelp the product and design team work through the product specification, design and feasibility process\u003c/li\u003e\n\u003cli\u003eContribute unit and integration tests for new and existing features\u003c/li\u003e\n\u003cli\u003eProvide effective and constructive feedback on other engineer’s contributions\u003c/li\u003e\n\u003cli\u003eResearch and recommend new technologies, help set best practices and coding standards\u003c/li\u003e\n\u003cli\u003eUphold BentoBox’s core mission, vision, and values\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eSkills and Attributes\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e4+ years of experience writing production code\u003c/li\u003e\n\u003cli\u003eSome experience with writing code within the context of a web based framework such as Django or Rails\u003c/li\u003e\n\u003cli\u003eA strong understanding of Javascript fundamentals\u003c/li\u003e\n\u003cli\u003eSome level of experience with React (with or without Redux)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eBenefits\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCompetitive salary and equity\u003c/li\u003e\n\u003cli\u003eHealth insurance, including vision and dental\u003c/li\u003e\n\u003cli\u003eFlexible vacation plan\u003c/li\u003e\n\u003cli\u003eFriday lunches\u003c/li\u003e\n\u003cli\u003eCulture perks like dinners at BentoBox customers, cocktail classes, etc.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003ePlease share with us why you’re interested in this position. Include a link to your Github account, or any other public code samples you’d like to share with us.\u003c/p\u003e\n\u003cp\u003eHiring Process\u003c/p\u003e\n\u003cp\u003eCandidates for this position can expect the hiring process to follow the order below.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eQualified applicants will be invited to schedule a 30-minute screening call with our Recruiting team.\u003c/li\u003e\n\u003cli\u003eIf moved forward to the next round, candidates will be invited to our office to meet with our CTO and Lead Front-End Engineer.\u003c/li\u003e\n\u003cli\u003eNext, qualified candidates will be asked to submit a code sample to showcase their work.\u003c/li\u003e\n\u003cli\u003eSuccessful candidates will be made an offer.\u003c/li\u003e\n\u003c/ul\u003e\n",
            "how_to_apply": "\u003cp\u003ePlease apply by submitting your application using this link: \u003ca href=\"https://grnh.se/9b0db74f2\"\u003ehttps://grnh.se/9b0db74f2\u003c/a\u003e\u003c/p\u003e\n",
            "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcnRwIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--de5106947fdc894d8b0ecfc306bd86aa74d02651/bentobox-logo-220px.png"
        },
        {
            "id": "39162f03-bc29-46b3-97f5-27ff4cc38fba",
            "type": "Full Time",
            "url": "https://jobs.github.com/positions/39162f03-bc29-46b3-97f5-27ff4cc38fba",
            "created_at": "Sat Aug 03 22:20:58 UTC 2019",
            "posted": "3 Days ago",
            "company": "InQuest",
            "company_url": "http://www.inquest.net",
            "location": "Austin, TX, USA",
            "title": "Senior Python Developer/PM/Architect",
            "searchType": "JobsForYou",
            "description": "\u003cp\u003eInQuest, a leading provider of cybersecurity services and solutions for both the private and public sector, is looking for Senior Python 3 developer to work with both our frontend and backend development teams. You will architect and plan new products, as well as provide maintenance on existing projects. You will serve as a project manager and interface with folks on UI, backend, and threat intelligence to ensure that requirements are met and delivered to our hardware, software and SaaS platforms.\u003c/p\u003e\n\u003cp\u003eThe InQuest platform provides high-throughput Deep File Inspection (DFI) for threat and data leakage prevention, detection, and hunting. We aim to automate and scale the expert knowledge of a typical SOC analyst. Available on-premise or as a service, we leverage a variety of sources in our automated decision-making engine. This includes bi-directional orchestration with multi-scanning and sandbox platforms, unique threat intelligence sources, and a seasoned signature development team augmented by machine learning.\u003c/p\u003e\n\u003cp\u003eFounded in 2013, the InQuest leadership and engineering teams comprise of passionate security researchers hailing from both the public and private sectors. Our mission is to deliver our decades of lessons-learned to protect users and organizations everywhere. We strive to maintain our hands-on familiarity with a wide range of prevention, analysis, and monitoring solutions. Continuously exploring, examining, and validating security vendors. We aim to continue our community involvement through contributions by way of talks, publications, open-source software, and researcher collaboration.\u003c/p\u003e\n\u003cp\u003eTwo unfair advantages fuel our team's passion:\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003eWe've worked with thousands of real-world exploits from vulnerability discovery and exploitation specialists from all-around the world.\u003c/li\u003e\n\u003cli\u003eWe've vetted nearly every major security vendor under the Sun. Working with the best-in-class COTS and OSS solutions across the spectrum.\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003eThrough 2017, we operated in stealth-mode, primarily servicing the Department of Defense and Intelligence Community. Expanding by word-of-mouth and perfecting our solution. In 2018 we came out of stealth mode with the launch of our flagship on-premise appliance fleet, supporting up to 20Gb/sec in a 1RU form-factor. In tandem, we made publicly available a slew of open-source software and threat intelligence contributions via GitHub and began interfacing with the community via our blog and Twitter. Regardless of how the InQuest solution is deployed, our goals are to:\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003eOperate at scale to support the needs of businesses ranging from small offices to global enterprises.\u003c/li\u003e\n\u003cli\u003eExpose deeply embedded content through novel methods, automating typically human-intensive tasks.\u003c/li\u003e\n\u003cli\u003eUtilize all available resources to automate the identification and validation of threats lurking in the environment.\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003eThis is both a key role and an exciting time to join the team. You'll be working mostly from our office in downtown Austin Texas with the option to work remotely as needed. For more information visit us at \u003ca href=\"http://www.inquest.net\"\u003ewww.inquest.net\u003c/a\u003e or apply and let's have a conversation.\u003c/p\u003e\n\u003cp\u003eResponsibilities:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eWork with our frontend and backend engineers to implement a Flask-based web application for our products\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eParticipate in code reviews of new and maintenance code\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eYou will write and deliver code for new applications, as well as help with maintenance on existing platforms\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eWork with our product management team to help build a roadmap for various product offerings\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eHelp guide and mentor junior and mid-level developers\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eHelp write documentation for new systems and work with the documentation team to provide excellent documentation for users and internal staff.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eRequirements:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003e6+ years doing web-focused, server-side development\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eCan work with Postgres and MySQL, and understand basic DBA functions\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eHave worked with large data set\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eHave working knowledge of Python 3, pipenv, unittes\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eUnderstanding of API construction\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eHave worked with Continuous Integration systems\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eCan work with git, GitHub, and understand the git-flow workflow\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eUnderstanding of AWS\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eGreat to have:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eUnderstanding of Test Driven Development and Behavioral Driven Development\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eKnowledge of front-end development, including CSS and JavaScript\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eHave worked in PHP and Golang\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eHave worked with Ansible\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eBackground in the IT Security field\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eTo learn more about InQuest, please visit the following:\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.linkedin.com/company/inquest.net\"\u003ehttps://www.linkedin.com/company/inquest.net\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://github.com/inquest\"\u003ehttps://github.com/inquest\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://pypi.org/user/inquestlabs/\"\u003ehttps://pypi.org/user/inquestlabs/\u003c/a\u003e\u003c/p\u003e\n",
            "how_to_apply": "\u003cp\u003ePlease email your resume to \u003ca href=\"mailto:careers@inquest.net\"\u003ecareers@inquest.net\u003c/a\u003e\u003c/p\u003e\n",
            "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBak51IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--04f4118a136f0691b1411c5b26656502e005f76f/InQuest_Logo-1920x1080.png"
        },
        {
            "id": "e9e632a7-c756-40c9-b1ca-c3eb5c7f9ce3",
            "type": "Full Time",
            "url": "https://jobs.github.com/positions/e9e632a7-c756-40c9-b1ca-c3eb5c7f9ce3",
            "created_at": "Sat Aug 03 00:50:23 UTC 2019",
            "posted": "3 Days ago",
            "company": "Expeditors",
            "company_url": "http://gameclosure.com",
            "location": "San Francisco, Tokyo",
            "title": "Senior Game Engineer",
            "searchType": "JobsNearYou",
            "description": "\u003cp\u003eGame Closure is on the hunt for  Senior Game Engineers to help us build the social games that will be tomorrow’s biggest hits on Facebook and other social media platforms. We are a growing team with offices in San Francisco and Mountain View, California, Tokyo, Japan and also some possibilities for remote work. If you want to join us to make great games on our cutting­ edge technology and truly make an impact, then we want to talk to you!\u003c/p\u003e\n\u003cp\u003eGame Closure game engineers make polished, high-performance HTML5 mobile games. We want people who are proficient with JavaScript and who are passionate about making fun social games to be played by millions! As a Game Engineer at Game Closure, you will build games internally on top of our cutting-edge and open source devkit. In addition to building kick­ass instant games, you will play a pivotal role in creating a platform which will revolutionize the future of game development.\u003c/p\u003e\n\u003cp\u003eIt's always a bonus if you know more than JavaScript! We write cross-compilers, GPU shaders, NodeJS back­ends, JavaScript game APIs and tools, and whatever else it takes. You will work with the best engineers in the world; we have top talent in every part of our stack.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eThe Role:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBe responsible for designing, developing and deploying major game features\u003c/li\u003e\n\u003cli\u003eOwn game feature areas from end-­to­-end\u003c/li\u003e\n\u003cli\u003eBe the champion for the user!\u003c/li\u003e\n\u003cli\u003eInsist on the highest standards and create functional and engaging features that will delight our users\u003c/li\u003e\n\u003cli\u003eBe part of a tight game development team looking to iterate fast on a fun concept and then building it out\u003c/li\u003e\n\u003cli\u003eHave real input on end-user product\u003c/li\u003e\n\u003cli\u003eBe a key member of a high performing software engineering team\u003c/li\u003e\n\u003cli\u003eCollaborate with design, engineering and production teams to devise optimal engineering solutions to game requirements\u003c/li\u003e\n\u003cli\u003eHands­ on architect and coder for sophisticated client/server systems for mobile gaming\u003c/li\u003e\n\u003cli\u003eInnovate and iterate on process, systems and technology to deliver world­-class social games\u003c/li\u003e\n\u003cli\u003eBe a leader; Identify and articulate technical and production risks and obstacles, as well as generate solutions!\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eDesired Skills:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBachelor's degree in Computer Science or related field, or equivalent experience.\u003c/li\u003e\n\u003cli\u003e3+ years of professional software engineering experience, working on cross functional teams.\u003c/li\u003e\n\u003cli\u003eProven effectiveness in directing or delivering production software for high quality games with at least one shipped game product of which you were a primary contributor (self­ published titles are acceptable).\u003c/li\u003e\n\u003cli\u003eCapable of JavaScript + HTML5 to create custom, interactive, user experiences that are enjoyable on all HTML5 browsers.\u003c/li\u003e\n\u003cli\u003eProficient at using script debuggers like Chrome Debugger.\u003c/li\u003e\n\u003cli\u003eStrong Computer Science fundamentals in object­-oriented design, algorithms, and data structures.\u003c/li\u003e\n\u003cli\u003eAdvanced software engineering skills, including the ability to write maintainable and robust code in a p popular object oriented language.\u003c/li\u003e\n\u003cli\u003eSolid familiarity with analytics and A/B testing in mobile games\u003c/li\u003e\n\u003cli\u003eFamiliarity with git, svn or other VCS.\u003c/li\u003e\n\u003cli\u003eSelf starter, analytical and creative\u003c/li\u003e\n\u003cli\u003eStrong team player with a positive attitude.\u003c/li\u003e\n\u003cli\u003eGood communication skills and the ability to work effectively on shared projects with designers, artists, testers, product managers and other developers.\u003c/li\u003e\n\u003cli\u003eCheck out Everwing on Facebook Instant Games in Messenger. Can you build this game?\u003c/li\u003e\n\u003cli\u003eUnderstanding of the reactive UI paradigm and experience building UIs using reactive UI frameworks (such as React, and state management Utilities like Redux).\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBonus:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCanvas animation work\u003c/li\u003e\n\u003cli\u003e2+ years of game development experience with multiple shipped titles\u003c/li\u003e\n\u003cli\u003eSpecialized skills in a particular area of game development (for example: UI, Physics, graphics, multiplayer, game logic, etc.)\u003c/li\u003e\n\u003cli\u003eExpert knowledge of TypeScript\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eGC Perks:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eMedical, Dental, \u0026amp; Vision: Top quality insurance options with 100% of premiums covered\u003c/li\u003e\n\u003cli\u003eSocial Events: Weekly team dinners, quarterly team excursions, game nights, karaoke, and more\u003c/li\u003e\n\u003cli\u003eCommuter Pass + Free Parking: Your commute and parking to the office is on us!\u003c/li\u003e\n\u003cli\u003ePTO: Unlimited vacation policy\u003c/li\u003e\n\u003cli\u003eMeals: Free daily lunches, well stocked kitchen, healthy snacks and drinks\u003c/li\u003e\n\u003cli\u003ePet-Friendly Office: Bring your pets to work to foster a friendlier and happier workplace\u003c/li\u003e\n\u003c/ul\u003e\n",
            "how_to_apply": "\u003cp\u003e\u003ca href=\"https://jobs.lever.co/gameclosure/a50c5aa4-6526-425f-9767-2b8e11800857?lever-origin=applied\u0026amp;lever-source%5B%5D=GitHub\"\u003ehttps://jobs.lever.co/gameclosure/a50c5aa4-6526-425f-9767-2b8e11800857?lever-origin=applied\u0026amp;lever-source%5B%5D=GitHub\u003c/a\u003e\u003c/p\u003e\n",
            "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcXB1IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--7748d0ca9d8773b6d5cf9db2b6d43f5184ddd5b8/expeditors.jpeg"
        },
        {
            "id": "46a7ddfc-04ad-4a3f-b17c-31c884978e2f",
            "type": "Full Time",
            "url": "https://jobs.github.com/positions/46a7ddfc-04ad-4a3f-b17c-31c884978e2f",
            "posted": "8 Days ago",
            "created_at": "Wed Aug 07 08:52:40 UTC 2019",
            "company": "Mercari, Inc.",
            "company_url": "https://about.mercari.com/en/",
            "location": "Tokyo",
            "title": "Software Engineer, Backend",
            "searchType": "JobsNearYou",
            "description": "\u003cp\u003eMercari is a marketplace app that makes it easy for people to safely sell and ship their things. Launched in 2013, the Mercari app has been downloaded over 100M times in Japan and the US. It's now among the largest peer-to-peer selling platforms globally. From fashion to toys, shoes to electronics and beyond, Mercari's mission is to create value in a global marketplace where anyone can buy and sell.\nKnow more: \u003ca href=\"https://about.mercari.com/en/\"\u003ehttps://about.mercari.com/en/\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e▼Job Description\u003c/p\u003e\n\u003cp\u003e・Design, development, and operation of Mercari's API and web app using Go\u003c/p\u003e\n\u003cp\u003e・Design, development, and operation of tools to support the customer support team and planning-related work\u003c/p\u003e\n\u003cp\u003e・Design, development, and operation of various microservices making up the Mercari API\u003c/p\u003e\n\u003cp\u003e・Lead the team's development\u003c/p\u003e\n\u003cp\u003eREQUIREMENTS\u003c/p\u003e\n\u003cp\u003e▼Minimum Qualifications\u003c/p\u003e\n\u003cp\u003e・Strong understanding of the company mission and values\u003c/p\u003e\n\u003cp\u003e・A minimum of 5 years backend software development, or equivalent, experience\u003c/p\u003e\n\u003cp\u003e・Experience with design, development, and operation of backend APIs using Go\u003c/p\u003e\n\u003cp\u003e・Knowledge of and experience with software test including unit testing, functional testing, e2e testing\u003c/p\u003e\n\u003cp\u003e・Knowledge of and experience with optimization of queries and data model design for the efficient usage of RDBMS and NoSQL databases.\u003c/p\u003e\n\u003cp\u003e・Cloud development experience (preferably GCP, or AWS)\u003c/p\u003e\n\u003cp\u003e・Experience with team development using Git/Github or similar version management systems\u003c/p\u003e\n\u003cp\u003e・Ability to design, develop and operate large-scale services in heavy traffic scenarios\u003c/p\u003e\n\u003cp\u003e・Experience with project management and/or team leadership\u003c/p\u003e\n\u003cp\u003e▼Preferred\u003c/p\u003e\n\u003cp\u003e・Experience developing and operating in a microservice architecture\u003c/p\u003e\n\u003cp\u003e・Experience with on-call support for a service\u003c/p\u003e\n\u003cp\u003e・Knowledge of web app security\u003c/p\u003e\n\u003cp\u003e・Experience with development using external APIs such as payment, delivery, etc.\u003c/p\u003e\n\u003cp\u003e・Experience sharing and contributing to an OSS project\u003c/p\u003e\n\u003cp\u003e・Experience with scrum\u003c/p\u003e\n\u003cp\u003e▼Technical Environment\u003c/p\u003e\n\u003cp\u003e・Languages: Go \u0026amp; PHP\u003c/p\u003e\n\u003cp\u003e・Infrastructure: Dedicated servers, MySQL, memcached, Nginx, Solr, Elastic Search, Google Cloud Platform (Compute Engine, Kubernetes Engine, Spanner, Cloud SQL, Datastore, Storage, Stackdriver Logging, Dataflow, Pub/Sub, etc.)\u003c/p\u003e\n\u003cp\u003e・Configuration management tool: Terraform\u003c/p\u003e\n\u003cp\u003e・CI/CD: Circle CI / Spinnaker\u003c/p\u003e\n\u003cp\u003e・Monitoring: Stackdriver Monitoring / Datadog / PagerDuty / Sentry / Mackerel / NewRelic / ELK Stack\u003c/p\u003e\n\u003cp\u003e・Knowledge Tools: Confluence / Crowi\u003c/p\u003e\n\u003cp\u003e・Other: GitHub / Slack / JIRA\u003c/p\u003e\n\u003cp\u003e・Process: Scrum\u003c/p\u003e\n",
            "how_to_apply": "\u003cp\u003eApply through this link and mention \"GithubJobs\" in the referrals section: \u003ca href=\"https://wrkbl.ink/85TeWjY\"\u003ehttps://wrkbl.ink/85TeWjY\u003c/a\u003e\u003c/p\u003e\n",
            "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc0p1IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--683e3b6bc0868fa1889c6c96d0d8ba4d7035d402/AL_h01.png"
        },
        {
            "id": "acc144f4-7e0c-4030-b1a7-9c68017e2296",
            "type": "Full Time",
            "url": "https://jobs.github.com/positions/acc144f4-7e0c-4030-b1a7-9c68017e2296",
            "created_at": "Wed Aug 07 08:29:31 UTC 2019",
            "posted": "3 Days ago",
            "company": "Die Schittigs GmbH",
            "company_url": "https://www.dieschittigs.de",
            "location": "Aschaffenburg",
            "title": "Web Developer",
            "searchType": "JobsForYou",
            "description": "\u003ch2\u003eWe're looking for you:\u003c/h2\u003e\n\u003cp\u003eAs a Full-Stack Developer (m/f/d) you develop high-quality digital products with a great team.\u003c/p\u003e\n\u003ch2\u003eWhat you do:\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eImplementing screen layouts in HTML/SCSS\u003c/li\u003e\n\u003cli\u003eDeveloping web applications in JavaScript\u003c/li\u003e\n\u003cli\u003eDeveloping APIs and backends with PHP/Node\u003c/li\u003e\n\u003cli\u003eDeveloping concepts and evaluating complex websites and apps from a technical point of view\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eYour skills:\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eAt least 3 years of experience in web development\u003c/li\u003e\n\u003cli\u003eProfound knowledge of HTML and CSS \u0026amp; Javascript\u003c/li\u003e\n\u003cli\u003eGood knowledge of PHP\u003c/li\u003e\n\u003cli\u003eStrong UX design sensibility\u003c/li\u003e\n\u003cli\u003eBasic Git knowledge\u003c/li\u003e\n\u003cli\u003eExperience with either React (native), VueJS or Laravel\u003c/li\u003e\n\u003cli\u003eHigh standards – regarding the implementation of designs and regarding your code\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e##What to expect:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eFlexible working hours, no overtime\u003c/li\u003e\n\u003cli\u003e30 vacation days\u003c/li\u003e\n\u003cli\u003e2.5 minutes distance to the train station\u003c/li\u003e\n\u003cli\u003eWe cook and lunch together almost every day\u003c/li\u003e\n\u003cli\u003eFriendly, appreciative atmosphere\u003c/li\u003e\n\u003cli\u003eWeb developers are involved in the whole project: from offer, layout to support \u0026amp; care\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eDie Schittigs is an owner-run agency in Aschaffenburg. Since 2011, we pride ourselves on delivering memorable websites, mobile and web apps and online tools that make an impact and add value.\u003c/p\u003e\n\u003cp\u003eWe are looking forward meeting you!\u003c/p\u003e\n",
            "how_to_apply": "\u003cp\u003eEmail us at \u003ca href=\"mailto:jobs@dieschittigs.de\"\u003ejobs@dieschittigs.de\u003c/a\u003e\u003c/p\u003e\n",
            "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc0J1IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--310dddc4e8f0a9cf996435602b4eb74ad8a77028/finanzen.de.jpg"
        },
        {
            "id": "da92fe12-509c-4c59-9709-4caea9bf711b",
            "type": "Full Time",
            "url": "https://jobs.github.com/positions/da92fe12-509c-4c59-9709-4caea9bf711b",
            "created_at": "Tue Aug 06 21:09:00 UTC 2019",
            "posted": "1 Days ago",
            "company": "one-G simulation",
            "company_url": "https://flyone-g.com/",
            "location": "Seattle ",
            "title": "Software Developer (aviation)",
            "searchType": "JobsForYou",
            "description": "\u003cp\u003eSOFTWARE DEVELOPER\nWe are a highly motivated team.  We love to work hard and play hard.  We are collectively driven to improve aviation safety, and this is your chance to join something amazing.  Work in the fun \u0026amp; cool Ballard neighborhood of Seattle, WA and experience great restaurants, nightlife, and exercise opportunities.  Enjoy the flexible benefits of working with a small team and see your contributions broadly impact our goals.\u003c/p\u003e\n\u003cp\u003eRequired first-day\u003c/p\u003e\n\u003cp\u003eYou will walk in the door as a hands-on self-starter who is motivated to learn.\u003c/p\u003e\n\u003cp\u003eYou have a solid foundation in software design using best coding practices.\u003c/p\u003e\n\u003cp\u003eKnowledge of the following programming languages and frameworks. Ability to quickly pick up other languages and frameworks as needed\u003c/p\u003e\n\u003cp\u003eC# and .NET framework\u003c/p\u003e\n\u003cp\u003eC/C++ and STL\u003c/p\u003e\n\u003cp\u003eHTML/CSS and Javascript\u003c/p\u003e\n\u003cp\u003eExposure to\u003c/p\u003e\n\u003cp\u003eMulti-threaded applications\u003c/p\u003e\n\u003cp\u003e2D and 3D graphics rendering applications\u003c/p\u003e\n\u003cp\u003eWeb server backend (node.js), and browser front-end environments\u003c/p\u003e\n\u003cp\u003eMicrocontroller environments (i.e. Arduino)\u003c/p\u003e\n\u003cp\u003eMS Visual Studio in Windows\u003c/p\u003e\n\u003cp\u003eKnowledge of, or ability to quickly learn the following\u003c/p\u003e\n\u003cp\u003eData structures\u003c/p\u003e\n\u003cp\u003eMathematical concepts (vector and matrix operations, trig)\u003c/p\u003e\n\u003cp\u003eDatabase design, usage and indexing concepts\u003c/p\u003e\n\u003cp\u003eGeospatial concepts (working with maps, coordinate systems, distance/bearing measurements)\u003c/p\u003e\n\u003cp\u003eBasic aviation concepts\u003c/p\u003e\n\u003cp\u003eNetworking protocols\u003c/p\u003e\n\u003cp\u003eMaintenance and deployment on Linux servers (configuring services, running backup routines, using bash scripts, etc)\u003c/p\u003e\n\u003cp\u003eBasic electronic circuits\u003c/p\u003e\n\u003cp\u003eScalability, and performance optimization concepts. Memory management.\u003c/p\u003e\n\u003cp\u003eBest practices for software design and maintainability\u003c/p\u003e\n\u003cp\u003eProper computer assembly and configuration process. Use of hard disk imaging tools.\u003c/p\u003e\n\u003cp\u003eGeneral knowledge of graphics rendering using frameworks such as DirectX and GDI+\u003c/p\u003e\n\u003cp\u003eUse of project management systems, bug tracking, and version control systems.\u003c/p\u003e\n\u003cp\u003eBonus skills:\u003c/p\u003e\n\u003cp\u003eX-Plane experience, writing plugins for X-Plane\u003c/p\u003e\n\u003cp\u003eSimulation aircraft and scenery development\u003c/p\u003e\n\u003cp\u003ePilot certificate\u003c/p\u003e\n\u003cp\u003eExperience with CentOS, nginx, Redis, MongoDB, jQuery, Bootstrap, Git, JIRA\u003c/p\u003e\n\u003cp\u003eNow with all of that stated, we recognize that’s a long list of skills so if you’re a motivated, self-starter with some mad programming skills and still cutting your teeth in some of the other described areas, we may still have a great home for you here at one-G.\u003c/p\u003e\n\u003cp\u003eIf qualified and interested please send a resume and cover letter to \u003ca href=\"mailto:hiring@flyone-g.com\"\u003ehiring@flyone-g.com\u003c/a\u003e. Thanks!\u003c/p\u003e\n",
            "how_to_apply": "\u003cp\u003ePlease send resume and cover letter to \u003ca href=\"mailto:hiring@flyone-g.com\"\u003ehiring@flyone-g.com\u003c/a\u003e\u003c/p\u003e\n",
            "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcnh1IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--86f3e594af2b89c3a782ddf50cac1c01eccf60fd/Compugroup.jpg"
        }
    ],
    "Cities": [
        {
            "url": "images/delhi.jpeg",
            "name": "New Delhi",
            "noOfJobs": "57 Jobs"
        },
        {
            "url": "images/gurgaon.jpeg",
            "name": "Gurgaon",
            "noOfJobs": "98 Jobs"
        },
        {
            "url": "images/noida.jpeg",
            "name": "Noida",
            "noOfJobs": "67 Jobs"
        },
        {
            "url": "images/gurgaon.jpeg",
            "name": "Gurgaon",
            "noOfJobs": "98 Jobs"
        },
        {
            "url": "images/delhi.jpeg",
            "name": "New Delhi",
            "noOfJobs": "57 Jobs"
        }
    ],
    "Categories": [
        {
            "name": "Sales",
            "noOfJobs": "260 Jobs"
        },
        {
            "name": "Back office",
            "noOfJobs": "157 Jobs"
        },
        {
            "name": "Marketing",
            "noOfJobs": "97 Jobs"
        },
        {
            "name": "IT",
            "noOfJobs": "459 Jobs"
        },
        {
            "name": "Front office",
            "noOfJobs": "157 Jobs"
        },
        {
            "name": "Sales",
            "noOfJobs": "57 Jobs"
        }
    ]
}